content-org/english/use-ox-hugo.org
#+title: How to Use ox-hugo
#+author: Yoshio Shimano
# 出版した日付
#+date: 2019-04-03
# 更新日を自動的につける
#+hugo_auto_set_lastmod: t
# 見出しをレベル 6 まで出す
#+OPTIONS: H:6 num:nil
#+OPTIONS: toc:1
#+STARTUP: indent
#+hugo_type: post
# 出力するディレクトリ
#+hugo_base_dir: ../..
# 出版するファイル名
#+hugo_section: english/docs
#+OPTIONS: creator:nil author:t
#+LANGUAGE: en
# Hugo tags
#+hugo_tags: Hugo ox-hugo
# Hugo categories
#+hugo_categories: Hugo ox-hugo
#+hugo_custom_front_matter: :thumbnail images/org-to-hugo.svg
#+INFOJS_OPT: view:info toc:nil


** Do not put TOC in Summary
:PROPERTIES:
:EXPORT_DATE: 2019-04-03
:EXPORT_HUGO_SECTION: english/posts
:EXPORT_FILE_NAME: dont-insert-org-toc-into-summary
:EXPORT_OPTIONS: toc:nil num:nil
:ID:       ffdf3a31-dd96-42c0-bd55-d21ea1f18db3
:END:

By default, The TOC generated by ox-hugo is
inserted into "Summary" in Hugo.

This is how to prebent it
(Taken from ox-hugo test site).

*** Copy summary_minus_toc.html
:PROPERTIES:
:ID:       a03829fa-c4dc-400a-a4bd-638d770c360d
:END:

Copy  [[https://github.com/kaushalmodi/hugo-bare-min-theme/blob/master/layouts/partials/summary_minus_toc.html][=summary_minus_toc.html=]] 
from this site.

-  [[https://github.com/kaushalmodi/hugo-bare-min-theme/blob/master/layouts/partials/summary_minus_toc.html][=summary_minus_toc.html=]] 

=summary_minus_toc.html= looks like this:

#+caption: layouts/partials/summary_minus_toc.html
#+name: list: summary_minus_toc
#+begin_src html
{{- with .Description -}}
    {{- . | markdownify | printf "<p>%s</p>" | safeHTML -}}
{{- else -}}
    {{- $summary_has_org_toc := substr .Content 0 30 | findRE "[\".]ox-hugo-toc" -}}
    {{- if $summary_has_org_toc -}}
        {{- $content_splits := split .RawContent "<!--endtoc-->" -}} <!-- Need to use .RawContent as we will be parsing for 'more' comment later. -->
        <!-- If Org TOC is present, the special comment endtoc would also be present.
             In that case, output only the part *after* that comment as Summary. -->
        {{- $summary_raw := index $content_splits 1 -}}
        {{- $summary_splits := split $summary_raw "<!--more-->" -}}
        {{- if eq (len $summary_splits) 2 -}}
            {{- index $summary_splits 0 | markdownify -}}
        {{- else -}}
            {{- $summary_raw | markdownify | truncate 300 -}}
        {{- end -}}
    {{- else -}}
        <!-- Print the whole Summary if endtoc special comment is not found. -->
        {{- .Summary |  printf "<p>%s</p>" | safeHTML -}}
    {{- end -}}
{{- end -}}
#+end_src

I modified some code as below so that
raw HTML codes are not shown.

#+caption: Modified summary_minus_toc.html
#+begin_src html
{{- with .Description -}}
    {{- . | markdownify | printf "<p>%s</p>" | safeHTML -}}
{{- else -}}
    {{- $summary_has_org_toc := substr .Content 0 30 | findRE "[\".]ox-hugo-toc" -}}
    {{- if $summary_has_org_toc -}}
        {{- $content_splits := split .RawContent "<!--endtoc-->" -}} <!-- Need to use .RawContent as we will be parsing for 'more' comment later. -->
        <!-- If Org TOC is present, the special comment endtoc would also be present.
             In that case, output only the part *after* that comment as Summary. -->
        {{- $summary_raw := index $content_splits 1 -}}
        {{- $summary_splits := split $summary_raw "<!--more-->" -}}
        {{- if eq (len $summary_splits) 2 -}}
            {{- index $summary_splits 0 | markdownify -}}
        {{- else -}}
            {{- $summary_raw | markdownify | plainify | truncate 300 -}}
        {{- end -}}
    {{- else -}}
        <!-- Print the whole Summary if endtoc special comment is not found. -->
        {{- .Summary |  printf "<p>%s</p>" | safeHTML -}}
    {{- end -}}
{{- end -}}
#+end_src

I changed this:

#+begin_src html
{{- $summary_raw | markdownify | truncate 300 -}}
#+end_src

to:

#+begin_src html
{{- $summary_raw | markdownify | plainify | truncate 300 -}}
#+end_src


This works as follows:

- If =#+DESCRIPTION:= exitst, it will be used.
- If ox-hugo has made a TOC (if class =ox-hugo-toc= exists).
  delte it, make "Summary".

*** How to use summary_minus_toc.html
:PROPERTIES:
:ID:       fa856510-e59f-4652-b4e9-2eccbdd0af26
:END:
In a template containig "Summary",
use this code:


#+caption: How to use summary_minus_toc.html
#+begin_src html
{{ partial "summary_minus_toc.html" . }}
#+end_src

